---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSetting.DistributionSysTypes
source: html/64780ae2-610f-35a1-18be-88b7be2e4abc.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSetting.DistributionSysTypes Property

Get all distribution system types of the project.

## Syntax (C#)
```csharp
public DistributionSysTypeSet DistributionSysTypes { get; }
```